Repository: dsnallfot/CarbCounter
Catalog: Carb Counter/*.lproj/Localizable.strings
Languages: sv

# Måltidshistorik
source: Meal history
sv: Måltidshistorik

# Historik
source: History
sv: Historik

# KH %.0f g
source: Carbs %.0fg
sv: Kh %.0fg

# Fett %.0f g
source: Fat %.0fg
sv: Fett %.0fg

# Bolus %.2f E
source: Bolus %.2fU
sv: Bolus %.2fE

# Radera måltidshistorik
source: Delete meal history
sv: Radera måltidshistorik

# Bekräfta att du vill radera denna måltid från historiken?
source: Confirm that you want to delete this meal from history?
sv: Bekräfta att du vill radera denna måltid från historiken?

# Servera hela måltiden igen
source: Serve the same meal again
sv: Servera hela måltiden igen

# Måltid %@
source: Meal %@
sv: Måltid %@

# KH %@ g
source: Carbs %@g
sv: Kolh. %@g

# Fett %@ g
source: Fat %@g
sv: Fett %@g

# Bolus %@ E
source: Bolus %@U
sv: Bolus %@E

# Åt upp %@ st [Serverades %@ st - Lämnade %@ st]
source: Ate %@ serv [Served %@ serv - Left %@ serv]
sv: Åt upp %@ st [Serverades %@ st - Lämnade %@ st]

# Åt upp %@ g [Serverades %@ g - Lämnade %@ g]
source: Ate %@ g [Served %@ g - Left %@ g]
sv: Åt upp %@ g [Serverades %@ g - Lämnade %@ g]

# Åt upp %@ st
source: Ate %@ serv
sv: Åt upp %@ st

# Åt upp %@ g
source: Ate %@ g
sv: Åt upp %@ g

# Filter: Liknande
source: filter:similar
sv: filter:liknande

# Måltider
source: Meals
sv: Måltider

# Dygn
source: Day
sv: Dygn

# Frukost
source: Breakfast
sv: Frukost

# Mellis
source: Snack
sv: Mellis

# Middag
source: Dinner
sv: Middag

# Sök livsmedel
source: Search Food Item
sv: Sök livsmedel

# Till datum
source: To Date
sv: Till datum

# Från datum
source: From Date
sv: Från datum

# Måltidsinsikter
source: Insights
sv: Insikter

# Serverats antal gånger
source: Times served
sv: Serverats antal gånger

# Genomsnittlig portion
source: Average serving size
sv: Genomsnittlig portion

# Största portion
source: Largest serving
sv: Största portion

# Minsta portion
source: Smallest serving
sv: Minsta portion

# Portionshistorik
source: Servings history
sv: Portionshistorik

# %.1f st
source: %.1f serv
sv: %.1f st

# Medelvärden måltider (Datum och tid)
source: Meal average values
sv: Medelvärden måltider

# Medianvärden måltider (Datum och tid)
source: Meal median values (For selected dates)
sv: Medianvärden måltider (för valda datum)

# Verklig insulinkvot
source: Actual Carb Ratio
sv: Verklig insulinkvot

# Insikter
source: Insights
sv: Insikter

# Mer insikter
source: Show insights
sv: Visa insikter

# Visa portionsförslag
source: Suggested serving size
sv: Visa portionsförslag

# Visa livsmedelhistorik
source: Show food item history
sv: Visa livsmedelhistorik

# Hitta liknande måltider
source: Find similar meals
sv: Hitta liknande måltider

# Visa historik
source: Show item history
sv: Visa historik

# Välj datum och ett livsmedel för att visa mer information
source: Select a date interval and a food item to show more information
sv: Välj datumintervall och ett livsmedel för att visa mer information

# Ingen måltidshistorik tillgänglig för "%@"
source: No meal history found for "%@"
sv: Ingen måltidshistorik tillgänglig för "%@"

# det valda livsmedlet
source: the selected food item
sv: det valda livsmedlet

# Inga sökträffar inom valt datumintervall
source: No matches in selected date range
sv: Inga sökträffar inom valt datumintervall

# Använd genomsnittlig portion
source: Use average serving size
sv: Använd genomsnittlig portion

source: Do you want to use the average serving size from meal history: %.0f g for %@?
sv: Vill du använda måltidshistorikens genomsnittliga portionsstorlek: %.0f g för %@?

# Sök i historiken
source: Search history
sv: Sök i historiken

# Datum
source: Date
sv: Datum

# Tid
source: Time
sv: Tid

# till
source: to
sv: till

# %@ %@ Kh: %.0f g Fett: %.0f g Protein: %.0f g Bolus: %.2f E
source: %@ %@ Carbs: %.0f g Fat: %.0f g Protein: %.0f g Bolus: %.2f U
sv: %@ %@ Kh: %.0f g Fett: %.0f g Protein: %.0f g Bolus: %.2f E

# Visa i Nightscout
source: Show in Nightscout
sv: Visa i Nightscout

# Ingen data
source: No data selected
sv: Ingen data

source: Could not load Nightscout. Check your internet connection and try again.
sv: Kunde inte ladda Nightscout-sidan. Kontrollera din internetanslutning och försök igen.

# Nightscout • Måltid %@
source: Nightscout • Meal %@
sv: Nightscout • Måltid %@

# Välj datum och ett livsmedel
source: Select a date and a food item
sv: Välj datum och ett livsmedel

# Portion uppäten
source: Serving size
sv: Uppäten portion

# Kolhydrater (g)
source: Carbohydrates (g)
sv: Kolhydrater (g)

# Hämtar rapport
source: Fetching report
sv: Hämtar rapport

# Inställningar
source: Settings
sv: Inställningar

# Carb Ratio schema
source: Carb Ratio Schedule
sv: Schema Insulinkvoter

# Startdoser schema
source: Start Dose Schedule
sv: Schema Startdoser

# Dela data
source: Share Data
sv: Dela data

# Fjärrstyrning
source: Remote Control
sv: Fjärrstyrning

# Tillåt fjärrstyrning
source: Allow Remote Control
sv: Tillåt fjärrstyrning

# Tillåt datarensning
source: Allow Data Clearing
sv: Tillåt datarensning

# Schema
source: Schedule
sv: Schema

# Fraktion
source: Fraction
sv: Fraktion

# Startdoser
source: Start Doses
sv: Startdoser

# Startdos Fraktion
source: Start Dose Fraction
sv: Startdos Fraktion

# Maxgräns Kolhydrater (g)
source: Max Carbs (g)
sv: Maxgräns Kolhydrater (g)

# Maxgräns Kolhydrater
source: Max Carbs
sv: Maxgräns Kolhydrater

# Maxgräns Bolus (E)
source: Max Bolus (E)
sv: Maxgräns Bolus (E)

# Maxgräns Bolus
source: Max Bolus
sv: Maxgräns Bolus

# Override-faktor
source: Override Factor
sv: Förinställd Override-faktor

source: Override
sv: Förinställd Override

# Blodsocker enhet
source: Bloodglucose Units
sv: Blodsocker enhet

# Skolmaten URL
source: Skolmaten.se RSS
sv: Skolmaten URL

# Exkludera sökord
source: Excluded search terms
sv: Exkludera sökord

# Lägg till top-ups
source: Add carb top-ups
sv: Lägg till top-ups

source: Select whether you want to use scheduled start doses (set under ‘Start Dose Schedule’ above) or if you want to use ‘Start Dose Fraction’ (according to the setting below).
sv: Välj om du vill vill använda schemalagda startdoser (Ställs in under 'Schema Startdoser' ovan) eller om du vill använda 'Startdos Fraktion' (enligt inställningen nedan).

source: Enable this setting if/when you want to be able to quickly delete all data related to food items, carb ratios, and start doses. When the setting is enabled, ‘Clear’ buttons will appear in the navigation bar in the respective view.
sv: Aktivera denna inställning om/när du snabbt vill kunna radera all data avseende livsmedel, favoriter, historik, insulinkvoter eller startdoser. När inställningen är aktiverad dyker 'Rensa'-knappar upp i navigationsfältet i respektive vy

source: Enter the fraction of the total amount of carbohydrates in the meal to be used as a start dose when Start Dose ‘Fraction’ is selected. Example: If the meal contains 58 g of carbohydrates and the start dose fraction is set to 0.5, the start dose will be calculated based on 29 g of carbohydrates.
sv: Ange den fraktion av den totala mängden kolhydrater i måltiden som ska användas som startdos när Startdos 'Fraktion' är vald. Exempel: Om måltiden innehåller 58 g kolhydrater och startdos fraktionen är inställd på 0.5, kommer startdosen att beräknas utifrån 29 g kolhydrater.

source: Enter the maximum amount of carbohydrates that can be registered at one time. If you try to register a larger amount of carbohydrates, that value will automatically be capped to this specified maximum setting:
sv: Ange maxgränsen för hur mkt kolhydrater som kan registreras vid ett och samma tillfälle. Om du försöker registrera en större mängd kolhydrater, kommer det värdet automatiskt att justeras ner till denna angivna maxinställning:

source: Enter the maximum amount of bolus that can be given at one time. If you try to give a larger bolus, that value will automatically be capped to this specified maximum setting:
sv: Ange maxgränsen för hur mkt bolus som kan ges vid ett och samma tillfälle. Om du försöker ge en större bolus, kommer det värdet automatiskt att justeras ner till denna angivna maxinställning:

source: When, for example, breakfast is eaten later than usual, after the scheduled carb ratios have switched from breakfast ratios to daily ratios, they might need to be temporarily adjusted. This setting specifies how much the current insulin ratio should be adjusted when the ‘Override’ button is activated in the meal view:
sv: När exvis frukost äts senare än normalt, efter att de schemalagda insulinkvoterna växlat över från frukostkvoter till dagskvoter, så behöver kvoterna tillfälligt göras starkare. Denna inställning anger hur mycket den aktuella insulinkvoten ska justeras när 'Förinställd Override' aktiveras i måltidsvyn:

source: Select if you want to use mg/dl or mmol/L as blood glucose units in the app
sv: Välj om du vill vill använda mg/dl eller mmol/L som enhet för blodsockervärden i appen

# Ange din Nightscout URL:
source: Enter your Nightscout URL to be able to fetch Carb Ratios from your Nightscout profile:
sv: Ange din Nightscout URL:

# Ange din Nightscout Token:
source: Enter your Nightscout Token (If applicable):
sv: Ange din Nightscout Token:

source: If you want to use the Swedish food database Dabas, enter your API Secret. If you do not enter an API secret, OpenFoodFacts is used by default for EAN scanning and online food searches
sv: Om du vill använda den svenska livsmedelsdatabasen Dabas, ange din API Secret. Om du inte anger ngn API secret används OpenFoodFacts som default för EAN-scanning och livsmedelssökningar online

# Ange URL till Skolmaten.se RSS-flöde som du vill använda:
source: Enter the URL to your schools rss-feed from the swedish 'skolmaten.se' Rplatform. When you enter and URL a new button will show up on the 'Meal' screen where you can select from the skolmaten.se menu:
sv: Ange URL till din skolas rss-flöde på 'skolmaten.se' När du nger en URL så dyker en ny knapp '+ Skolmaten' upp i Måltidsvyn där du kan välja måltider från lunchmenyn:

source: To improve matching between skolmaten.se lunch menus, and the local food item database, you may choose to exclude some search terms. Separate the terms with periods or commas.
sv: För att förbättra matchningen mellan lunchmenyerna i skolmaten.se och appens livsmedelsdatabas, så kan du välja att exkludera vissa sökord. Ange sökorden separerade med punkt eller komma

source: Add foods that are often used to top up with carbohydrates when fewer carbohydrates have been consumed than insulin has been dosed for. Separate the entries with periods or commas.
sv: Lägg till livsmedel som ofta används för att toppa up med kolhydrater när det ätits färre kolhydrater än vad insulin doserats för. Separera livsmedlen med punkt eller kommatecken

# Om appen
source: About this app
sv: Om appen

# Uppdaterad:
source: Updated:
sv: Uppdaterad:

# Tillåt delning av pågående måltid
source: Allow sharing ongoing meal
sv: Tillåt delning av pågående måltid

# Välj vilken data du vill exportera
source: Choose which data to export
sv: Välj vilken data du vill exportera

# Hela databasen
source: Entire database
sv: Hela databasen

# Användarinställningar
source: User settings
sv: Användarinställningar

# Importera data
source: Import data
sv: Importera data

# Välj vilken data du vill importera
source: Choose which data to import
sv: Välj vilken data du vill importera

# Importera hela databasen
source: Import entire database
sv: Importera hela databasen

# Favoritmåltider
source: Favorite meals
sv: Favoritmåltider

# Import lyckades
source: Import successful
sv: Import lyckades

# Användarinställningarna har importerats.
source: User settings have been imported.
sv: Användarinställningarna har importerats.

# Export lyckades
source: Export successful
sv: Export lyckades

# Användarinställningarna har exporterats.
source: User settings have been exported.
sv: Användarinställningarna har exporterats.

# Documents/CarbsCounter/Användarinställningar
source: Documents/CarbsCounter/Usersettings
sv: Documents/CarbsCounter/Användarinställningar

# Rensa gammal måltidshistorik
source: Clear old meal history
sv: Rensa gammal måltidshistorik

# Rensa måltidshistorik
source: Clear meal history
sv: Rensa måltidshistorik

# Vill du radera all måltidshistorik äldre än 365 dagar?
source: Do you want to delete meal history older than 365 days?
sv: Vill du radera all måltidshistorik äldre än 365 dagar?

# Exportera data
source: Export data
sv: Exportera data

# Carb Ratio
source: Carb Ratios
sv: Insulinkvoter

# Är du säker på att du vill rensa all data?
source: Are you sure you want to clear all data?
sv: Är du säker på att du vill rensa all data?

# Nej
source: No
sv: Nej

source: Do you want to download Carb Ratios from Nightscout? Note that your current data will be overwritten.
sv: Vill du ladda ner dina Insulinkvoter från Nightscout? Observera att dina nuvarande data skrivs över.

# Carb ratios importerade och mappede från Nightscout.
source: Carb ratios imported and mapped from Nightscout.
sv: Insulinkvoter importerade och mappede från Nightscout.

# Kunde inte importera carb ratios från Nightscout.
source: Could not import carb ratios from Nightscout.
sv: Kunde inte importera Insulinkvoter från Nightscout.

# ⚠️ Rensa
source: ⚠️ Clear
sv: ⚠️ Rensa

source: SELECT REMOTE COMMANDS METHOD
sv: VÄLJ METOD FÖR REMOTE KOMMANDON

source: TWILIO SETTINGS
sv: TWILIO SMS INSTÄLLNINGAR

source: REMOTE CONFIGURATION
sv: REMOTE INSTÄLLNINGAR

source: Entered By
sv: Registrerat av

source: Secret Code
sv: Hemlig kod

# Använd genvägar
source: Use iOS Shortcuts
sv: Använd genvägar

# Använd SMS API
source: Use SMS API
sv: Använd SMS API

source: Twilio From #
sv: Twilio från #

source: Twilio To #
sv: Twilio till #

# Uppdatera registrerad mängd
source: Update Registered Amount
sv: Uppdatera registrerad mängd

# Uppdatera registrerad mängd kh, fett, protein och bolus.
source: Update registered amount of carbs, fat, protein, and bolus.
sv: Uppdatera registrerad mängd kh, fett, protein och bolus.

# Fett (g)
source: Fat (g)
sv: Fett (g)

# Startdos
source: Start Dose
sv: Startdos

# Logga måltidshistorik
source: Register meal history entry
sv: Logga måltidshistorik

# Skapa ett nytt inlägg i måltidshistoriken.
source: Register a new meal history entry.
sv: Skapa ett nytt inlägg i måltidshistoriken.

# Mängd
source: Amount
sv: Mängd

# Måltid uppdaterad
source: Meal Updated
sv: Måltid uppdaterad

# KH: %@g, Fett: %@g, Protein: %@g, Bolus: %@E
source: Carbs: %@g, Fat: %@g, Protein: %@g, Bolus: %@U
sv: KH: %@g, Fett: %@g, Protein: %@g, Bolus: %@E

# Måltid loggad i historiken
source: Meal Logged in History
sv: Måltid loggad i historiken

# Livsmedel: %@ Mängd: %.1fg Bolus: %.2fE Datum: %@
source: Food Item: %@ Amount: %.1fg Bolus: %.2fU Date: %@
sv: Livsmedel: %@ Mängd: %.1fg Bolus: %.2fE Datum: %@

# Kom ihåg att äta
source: Remember to Eat
sv: Kom ihåg att äta

# En prebolus på %.2f E gavs klockan %@
source: A pre-bolus of %.2f units was given at %@
sv: En prebolus på %.2f E gavs klockan %@

# Meny saknas
source: No menu
sv: Lunchmeny saknas

# Ingen lunchmeny tillgänglig för det valda datumet
source: The lunch menu is missing for the selected date.
sv: Ingen lunchmeny finns tillgänglig detta datum

# SCAN_BARCODE_KEY
source: Scan barcode
sv: Scanna streckkod

# ADD_FOOD_KEY
source: Add food item
sv: Lägg till livsmedel

# Uppdaterar data...
source: Refreshing data...
sv: Uppdaterar data...
