Repository: dsnallfot/CarbCounter
Catalog: Carb Counter/*.lproj/Localizable.strings
Languages: sv

# Räkna Kolhydrater
source: Carb Counter
sv: Räkna Kolhydrater

# Uppdaterar data
source: Loading data
sv: Uppdaterar data

# Uppdaterar måltidshistoriken...
source: Updating meal history...
sv: Uppdaterar måltidshistoriken...

# Uppdaterar favoritlistan...
source: Updating favorite meals...
sv: Uppdaterar favoritlistan...

# Uppdaterar livsmedelslistan...
source: Updating food items...
sv: Uppdaterar livsmedelslistan...

# Uppdaterar startdoser...
source: Updating start doses...
sv: Uppdaterar startdoser...

# Uppdaterar insulinkvoter...
source: Updating carb ratios...
sv: Uppdaterar insulinkvoter...

# Ta över registrering
source: Take over registration
sv: Ta över registrering

# Ingen måltidsregistrering pågår
source: No meal registration are currently shared
sv: Ingen måltidsregistrering delas just nu

# Pågående måltid
source: Ongoing meal
sv: Pågående måltid

# Ingen näringsinformation tillgänglig.
source: No nutritional information available.
sv: Ingen näringsinformation tillgänglig.

# LIVSMEDEL
source: FOOD ITEMS
sv: LIVSMEDEL

# PORTION
source: SERVED
sv: PORTION

# LÄMNAT
source: LEFT
sv: LÄMNAT

# KH
source: CARBS
sv: KH

# Reg KH
source: Reg Carbs
sv: Reg KH

# (av totalt behov %.2f E)
source: (of meal tot req %.2f U)
sv: (av totalt behov %.2f E)

# %.2f E
source: %.2f U
sv: %.2f E

# (av totalt %.0f g i måltiden)
source: (of meal tot carbs %.0f g)
sv: (av totalt %.0f g i måltiden)

# EditRegistration.Header
source: Registered values
sv: Registrerade värden

# EditRegistration.Carbs
source: Carbs
sv: Kolhydrater

# EditRegistration.Fat
source: Fat
sv: Fett

# EditRegistration.MealTime
source: Meal time
sv: Tid för måltid

# EditRegistration.Done
source: Done
sv: Klar

# EditRegistration.BolusMeasurement
source: U
sv: E

# DeleteAllValues.Title
source: Delete all values?
sv: Radera alla värden?

# DeleteAllValues.Message
source: Are you sure you want to delete all registered values? This action cannot be undone.
sv: Är du säker på att du vill radera alla registrerade värden? Denna åtgärd kan inte ångras.

# DeleteAllValues.Button
source: Delete
sv: Radera

# Lägg till eller ersätt?
source: Add or replace?
sv: Lägg till eller ersätt?

source: Note! You already have an ongoing meal registration. Do you want to add the new meal to the ongoing one, or do you want to replace the ongoing meal with the new one?
sv: Obs! Du har redan en pågående måltidsregistrering. Vill du addera den nya måltiden till den pågående, eller vill du ersätta den pågående måltiden med den nya?

# Kolhydratssnål Måltid
source: Low Carb Meal
sv: Kolhydratssnål Måltid

source: Todays school lunch seems to contain relatively few carbs. Consider adding any food item with additional carbs, such as bread, fruit or some extra milk.
sv: Dagens skollunch verkar innehålla relativt lite kolhydrater. Komplettera gärna med extra kolhydrater, exvis en skiva knäckebröd, en frukt eller extra mjölk.

# Ersätt
source: Replace
sv: Ersätt

# Addera
source: Add
sv: Addera

# Avbryt
source: Cancel
sv: Avbryt

# Måltid
source: Meal
sv: Måltid

# Avsluta måltid
source: Finish meal
sv: Avsluta måltid

# Avsluta Måltid
source: Finish Meal
sv: Avsluta Måltid

source: Confirm that you want to clear all selected food items and entered values for this meal. This action cannot be undone.
sv: Bekräfta att du vill rensa alla valda livsmedel och inmatade värden för denna måltid. Åtgärden kan inte ångras.

# Rensa
source: Clear
sv: Rensa

# 0 E
source: 0 U
sv: 0 E

# E
source: U
sv: E

# + RESTERANDE
source: + REMAINING
sv: + RESTERANDE

# 0.00 E
source: 0.00 U
sv: 0.00 E

# KOLHYDRATER
source: CARBS TOT
sv: KH TOT

# FETT
source: FAT TOT
sv: FETT TOT

# INSULINKVOT
source: CARB RATIO
sv: INSULINKVOT

# HELA DOSEN
source: FULL DOSE
sv: HELA DOSEN

# 0E
source: 0U
sv: 0E

# + STARTDOS
source: + START DOSE
sv: + STARTDOS

# REGGADE KH
source: REG. CARBS
sv: REGGADE KH

# %.0f g/E
source: %.0f g/U
sv: %.0f g/E

# %.1f g/E
source: %.1f g/U
sv: %.1f g/E

# Inga livsmedel
source: No food items
sv: Inga livsmedel

# Välj minst ett livsmedel för att spara en favorit.
source: Select at least one food to save as a favorite.
sv: Välj minst ett livsmedel för att spara en favorit.

# Spara som favoritmåltid
source: Save as favorite meal
sv: Spara som favoritmåltid

# Ange ett namn på måltiden:
source: Enter a name for the meal:
sv: Ange ett namn på måltiden:

# Namn
source: Name
sv: Namn

# Min favoritmåltid
source: My favorite meal
sv: Min favoritmåltid

# Spara
source: Save
sv: Spara

# Lyckades
source: Success
sv: Lyckades

# Måltiden har sparats som favorit.
source: The meal has been saved as a favorite.
sv: Måltiden har sparats som favorit.

# Lyckades!
source: Success!
sv: Lyckades!

# Fel
source: Error
sv: Fel

# Tillfällig eller förinställd override?
source: Temporary or preset override?
sv: Tillfällig eller förinställd override?

source: Select if you want to use the preset override (%@), or enable a temporary override. If you want to enable a temporary override, please enter the override percentage in the field below.
sv: Välj om du vill aktivera den förinställda overriden (%@), eller om du vill ställa in en tillfällig override. Om du vill använda en tillfällig override kan du ange värdet i procent nedan

# Ange override-faktor i %
source: Enter temporary override %
sv: Ange tillfällig override %

# Använd tillfällig
source: Use temporary override
sv: Använd tillfällig override

# Använd %@
source: Use (%@)
sv: Använd (%@)

# Manuell aktivering
source: Manual activation
sv: Manuell aktivering

# Aktivera override
source: Activate override
sv: Aktivera override

# Ja
source: Yes
sv: Ja

# Klar
source: Done
sv: Klar

# + VÄLJ I LISTA
source: + FOOD ITEMS
sv: + VÄLJ I LISTA

# + SKOLMATEN
source: + SCHOOL
sv: + SKOLMATEN

# Maxgräns överskriden
source: Maximum limit exceeded
sv: Maxgräns överskriden

source: The meal registration %@ g carbs and %@ U bolus exceeds the set maximum limits: %@ g carbs and/or %@ U bolus. The dosage will therefore be adjusted down to the allowed maximum level in the next step...
sv: Måltidsregistreringen på %@ g kolhydrater och %@ E bolus överskrider de angivna maxgränserna: %@ g kolhydrater och/eller %@ E bolus. Doseringen justeras därför ner till den angivna maxnivån i nästa steg...

# Manuell registrering
source: Manual registration
sv: Manuell registrering

# • %@ g fett
source: • %@ g fat
sv: • %@ g fett

# • %@ E insulin
source: • %@ U insulin
sv: • %@ E insulin

# Status för denna måltid:
source: Status for this meal:
sv: Status för denna måltid:

source: BOLUS TOTAL
sv: BOLUS TOTALT

# Den beräknade mängden insulin som krävs för att täcka kolhydraterna i måltiden.
source: The estimated amount of insulin needed to cover the carbohydrates in the meal.
sv: Den beräknade mängden insulin som krävs för att täcka kolhydraterna i måltiden.

source: • Total estimated need: %@ • Registered so far: %@ U • Remaining to register: %@
sv: • Totalt beräknat behov: %@ • Hittills registerat: %@ E • Kvar att registrera: %@

# Kolhydrater Totalt
source: CARBOHYDRATES TOTAL
sv: KOLHYDRATER TOTALT

# Den beräknade summan av alla kolhydrater i måltiden.
source: The estimated total amount of carbohydrates in the meal.
sv: Den beräknade summan av alla kolhydrater i måltiden.

source: • Total amount of carbohydrates: %@ • Registered so far: %@ • Remaining to register: %@
sv: • Total mängd kolhydrater: %@ • Hittills registerat: %@ • Kvar att registrera: %@

# Fett Totalt
source: FAT TOTAL
sv: FETT TOTALT

source: The estimated total amount of fat in the meal. Fat also requires insulin, but with a few hours delay.
sv: Den beräknade summan av all fett i måltiden. Fett kräver också insulin, men med några timmars fördröjning.

# • Total mängd fett: %@ • Hittills registerat: %.0f g • Kvar att registrera: %@ g
source: • Total amount of fat: %@ • Registered so far: %.0f g • Remaining to register: %@ g
sv: • Total mängd fett: %@ • Hittills registerat: %.0f g • Kvar att registrera: %@ g

# Protein Totalt
source: PROTEIN TOTAL
sv: PROTEIN TOTALT

source: The estimated total amount of protein in the meal. Protein also requires insulin, but with a few hours delay.
sv: Den beräknade summan av all protein i måltiden. Protein kräver också insulin, men med några timmars fördröjning.

source: • Total amount of protein: %@ • Registered so far: %.0f g • Remaining to register: %@ g
sv: • Total mängd protein: %@ • Hittills registerat: %.0f g • Kvar att registrera: %@ g

# Insulinkvot
source: CARB RATIO
sv: INSULINKVOT

source: The value represents the amount of carbohydrates that 1 unit of insulin covers.
sv: Även kallad Carb Ratio (CR) Värdet motsvarar hur stor mängd kolhydrater som 1 E insulin täcker.

# CR %@ innebär att det behövs 2 E insulin till %@ g kolhydrater.
source: CR %@ means that 2 units of insulin are needed for %@ g of carbohydrates.
sv: CR %@ innebär att det behövs 2 E insulin till %@ g kolhydrater.

# Exempel:
source: Example:
sv: Exempel:

# Senaste override
source: LATEST OVERRIDE
sv: SENASTE OVERRIDE

# Senaste override • %@
source: LATEST OVERRIDE • %@
sv: SENASTE OVERRIDE • %@

# Aktiverades %@
source: Activated %@
sv: Aktiverad %@

# Ingen tidigare aktivering hittades.
source: No previous activation found.
sv: Ingen tidigare aktivering hittades.

# %.2fE
source: %.2fU
sv: %.2fE

# %.1fE
source: %.1fU
sv: %.1fE

# + KVAR ATT GE
source: + REMAINING
sv: + KVAR ATT GE

# KVAR ATT GE
source: REMAINING
sv: KVAR ATT GE

# + DOS
source: + PARTIAL
sv: + DELDOS

# DOS
source: START DOSE
sv: STARTDOS

# + HELA DOSEN
source: + FULL DOSE
sv: + HELA DOSEN

# ÖVERDOS!
source: OVERDOSE!
sv: ÖVERDOS!

# VÄNTAR
source: WAITING
sv: VÄNTAR

# PÅ INPUT
source: FOR INPUT
sv: PÅ INPUT

# KLAR
source: DONE
sv: KLAR

# MÅLTID
source: MEAL
sv: MÅLTID

# Varning
source: Warning
sv: Varning

source: You have registered more insulin than the calculated need. Make sure to add %@ g carbohydrates to avoid a low blood sugar!
sv: Du har registrerat mer insulin än det beräknade behovet. Se till att komplettera med %@ g kolhydrater för att undvika ett lågt blodsocker!

source: You have registered more carbohydrates than what's been eaten. Make sure to add %@ carbohydrates to avoid a low blood sugar!
sv: Du har registrerat mer kolhydrater än vad som har ätits! Se till att komplettera med %@ kolhydrater för att undvika ett lågt blodsocker!

# Nästa
source: Next
sv: Nästa

# Kolhydrater: %.1f g / st
source: Carbs: %.1f g/serv
sv: Kolhydrater: %.1f g / st

# Protein: %.1f g / st
source: Protein: %.1f g/serv
sv: Protein: %.1f g / st

# Kolhydrater: %.1f g / 100 g
source: Carbs: %.1f g/100 g
sv: Kolhydrater: %.1f g / 100 g

# Fett: %.1f g / 100 g
source: Fat: %.1f g/100 g
sv: Fett: %.1f g / 100 g

# st
source: serv
sv: st

# Sök & välj ett eller flera livsmedel
source: Search & select food items
sv: Sök & välj ett eller flera livsmedel

# Namn A-Ö
source: Name A-Z
sv: Namn A-Ö

# Skolmat
source: School
sv: Skolmat

# Styck
source: Servings
sv: Styck

# Populära
source: Popular
sv: Populära

# Välj livsmedel
source: Select food item
sv: Välj livsmedel

# Kh %.0fg/st
source: Carbs %.0fg/serv
sv: Kh %.0fg/st

# Fett %.0fg/st
source: Fat %.0fg/serv
sv: Fett %.0fg/st

# Protein %.0fg/st
source: Protein %.0fg/serv
sv: Protein %.0fg/st

# Kh %.0fg/100g
source: Carbs %.0fg/100g
sv: Kh %.0fg/100g

# Fett %.0fg/100g
source: Fat %.0fg/100g
sv: Fett %.0fg/100g

source: Remote Meal Carbohydrates: %@g Fat: %@g Protein: %@g Note: %@ Date: %@ Insulin: %@U Entered by: %@ Secret code: %@
sv: Remote Måltid Kolhydrater: %@g Fett: %@g Protein: %@g Notering: %@ Datum: %@ Insulin: %@E Inlagt av: %@ Hemlig kod: %@

# Kolhydrater:
source: Carbohydrates:
sv: Kolhydrater:

# Fett:
source: Fat:
sv: Fett:

# E
source: U
sv: E

# g/E
source: g/U
sv: g/E

# Registrera Måltid
source: Register Meal
sv: Registrera Måltid

# Registrera startdos
source: Register Start Dose
sv: Registrera startdos

# Registrera hela måltiden
source: Register Entire Meal
sv: Registrera hela måltiden

# ⓘ iOS Genväg
source: ⓘ iOS Shortcut mode
sv: ⓘ iOS Genväg

# ⓘ Twilio SMS
source: ⓘ Twilio SMS mode
sv: ⓘ Twilio SMS

# Skicka Måltid
source: Send Meal
sv: Skicka Måltid

# Skicka Måltid och Bolus
source: Send Meal and Bolus
sv: Skicka Måltid och Bolus

# Misslyckades
source: Error
sv: Misslyckades

# Ett fel uppstod när genvägen skulle köras. Du kan försöka igen.
source: An error prevented the shortcut from running. You may try again.
sv: Ett fel uppstod när genvägen skulle köras. Du kan försöka igen.

# Avbröts
source: Cancelled
sv: Avbröts

# Genvägen avbröts innan den körts färdigt. Du kan försöka igen.
source: The shortcut was cancelled before it was completed. You may try again.
sv: Genvägen avbröts innan den körts färdigt. Du kan försöka igen.

# Fel lösenkod
source: Wrong passcode
sv: Fel lösenkod

# Genvägen avbröts pga fel lösenkod. Du kan försöka igen.
source: The shortcut was cancelled due to wrong passcode. You may try again.
sv: Genvägen avbröts pga fel lösenkod. Du kan försöka igen.

# 🔂 Upprepa registrering
source: 🔂 Repeat Registration
sv: 🔂 Upprepa registrering

# Blodsocker
source: Blood Glucose
sv: Blodsocker

# Prognos BG
source: Eventual BG
sv: Prognos BG

# Uppdaterades
source: Updated
sv: Uppdaterades

# %@ E
source: %@ U
sv: %@ E

# %@ (%@ min sedan)
source: %@ (%@ min ago)
sv: %@ (%@ min sedan)

# Blodsockervarning!
source: Blood Glucose Warning!
sv: Blodsockervarning!

source: The latest forecast indicates that your blood sugar is or is expected to become low soon. It's likely best to start eating and wait a little while before administering any bolus for the meal. Do you still want to give a bolus for the meal now?
sv: Den senaste prognosen visar att blodsockret är eller förväntas bli lågt inom kort. Det är troligtvis bäst att börja äta och avvakta en liten stund innan du ger en bolus till måltiden. Vill du trots detta ge en bolus till måltiden redan nu?

# Blodsockervarning
source: Blood Glucose Warning
sv: Blodsockervarning

source: The latest forecast shows that blood glucose is expected to land within the target range later on, but may become low before it rises again. Are you sure you want to administer a bolus to the meal?
sv: Den senaste prognosen visar att blodsockret väntas landa inom målområdet längre fram, men kan bli lågt innan det vänder upp igen. Är du säker på att du vill ge en bolus till måltiden?

# Återstår att registrera
source: Remaining to register
sv: Kvar att registrera

# Kolhydrater
source: Carbohydrates
sv: Kolhydrater

# Fett
source: Fat
sv: Fett

# %@ g (av %@ g)
source: %@ g (of %@ g)
sv: %@ g (av tot %@ g)

# %@ E (av %@ E)
source: %@ U (of %@ U)
sv: %@ E (av tot %@ E)

# ⛔️ Maxgräns kolhydrater %@ g
source: ⛔️ Max carbs %@ g
sv: ⛔️ Maxgräns kolhydrater %@ g

# ⛔️ Maxgräns fett/protein %@ g
source: ⛔️ Max fat/protein %@ g
sv: ⛔️ Maxgräns fett/protein %@ g

# ⛔️ Maxgräns bolus %@ E
source: ⛔️ Max bolus %@ U
sv: ⛔️ Maxgräns bolus %@ E

# Bolus är inmatad i fel format
source: Bolus is entered in the wrong format
sv: Bolus är inmatad i fel format

# Ändra
source: Change
sv: Ändra

# Kolhydrater är inmatade i fel format
source: Carbohydrates are entered in the wrong format
sv: Kolhydrater är inmatade i fel format

# Fett är inmatat i fel format
source: Fat is entered in the wrong format
sv: Fett är inmatat i fel format

# Protein är inmatat i fel format
source: Protein is entered in the wrong format
sv: Protein är inmatat i fel format

# Måltidsregistreringen skickades
source: The meal registration was sent
sv: Måltidsregistreringen skickades

# Bekräfta måltid
source: Confirm meal
sv: Bekräfta måltid

# Vill du registrera denna måltid?
source: Do you want to register this meal?
sv: Vill du registrera denna måltid?

# Bekräfta måltid och bolus
source: Confirm meal and bolus
sv: Bekräfta måltid och bolus

# Vill du registrera denna måltid och ge %.2f E bolus?
source: Do you want to register this meal and give %.2f U bolus?
sv: Vill du registrera denna måltid och ge %.2f E bolus?

# Sök efter livsmedel online
source: Search for food items online
sv: Sök efter livsmedel online

# Tillbaka
source: Back
sv: Tillbaka

# Livsmedel
source: Food items
sv: Livsmedel

# Sök sparade
source: Search saved
sv: Sök sparade

# Sök online
source: Search online
sv: Sök online

# Sök bland %.0f sparade livsmedel
source: Search among %.0f saved food items
sv: Sök bland %.0f sparade livsmedel

# Sök efter nya livsmedel online
source: Search for new food items online
sv: Sök efter nya livsmedel online

# Ange vikt per styck i gram (valfritt)
source: Enter grams per serving (optional)
sv: Ange vikt per styck i gram (valfritt)

# Lägg till
source: Add
sv: Lägg till

# Befintlig data
source: Existing data
sv: Befintlig data

# Ny data
source: New data
sv: Ny data

# Kh:
source: Carbs:
sv: Kh:

# Fett:
source: Fat:
sv: Fett:

# Finns redan inlagt i livsmedelslistan.
source: Already exists in the food list.
sv: Finns redan inlagt i livsmedelslistan.

# Vill du behålla de befintliga näringsvärdena eller uppdatera dem?
source: Do you want to keep the existing nutritional values or update them?
sv: Vill du behålla de befintliga näringsvärdena eller uppdatera dem?

# Behåll befintliga
source: Keep existing
sv: Behåll befintliga

# Uppdatera
source: Update
sv: Uppdatera

# Ett fel uppstod vid hämtning av livsmedelsdata.
source: An error occurred while fetching food data.
sv: Ett fel uppstod vid hämtning av livsmedelsdata.

# Radera Livsmedel
source: Delete Food Item
sv: Radera Livsmedel

# Bekräfta att du vill radera: '%@'?
source: Confirm that you want to delete: '%@'?
sv: Bekräfta att du vill radera: '%@'?

# Radera
source: Delete
sv: Radera

# + Lägg till i måltid
source: + Add to meal
sv: + Lägg till i måltid

# Nollställ räknare
source: Reset counter
sv: Nollställ räknare

# Produkt
source: Product
sv: Produkt

# Kolhydrater:
source: Carbohydrates:
sv: Kolhydrater:

# g / st
source: g/serving
sv: g / st

# Serverats:
source: Served:
sv: Serverats:

# ggr
source: times
sv: ggr

# API Begränsning
source: API Limitation
sv: API Begränsning

# Vänta några sekunder innan nästa sökning
source: Wait a few seconds before the next search
sv: Vänta några sekunder innan nästa sökning

# Felaktig Dabas URL
source: Invalid Dabas URL
sv: Felaktig Dabas URL

# Dabas API fel: Ingen data togs emot
source: Dabas API error: No data received
sv: Dabas API fel: Ingen data togs emot

# OpenFoodFacts API fel: Ingen data togs emot
source: OpenFoodFacts API error: No data received
sv: OpenFoodFacts API fel: Ingen data togs emot

# Inga sökträffar
source: No search results
sv: Inga sökträffar

# Kolhydrater: %@ g / 100 g
source: Carbohydrates: %@ g / 100 g
sv: Kolhydrater: %@ g / 100 g

# Fett: %@ g / 100 g
source: Fat: %@ g / 100 g
sv: Fett: %@ g / 100 g

# Källa: OpenFoodFacts
source: Source: OpenFoodFacts
sv: Källa: OpenFoodFacts

# Kunde inte hitta information om livsmedlet
source: Could not find information about the food item
sv: Kunde inte hitta information om livsmedlet

# Källa: Dabas
source: Source: Dabas
sv: Källa: Dabas

# Dabas API fel: Kunde inte tolka svar från servern
source: Dabas API error: Could not interpret server response
sv: Dabas API fel: Kunde inte tolka svar från servern

source: Carbohydrates: %@ g / 100 g Fat: %@ g / 100 g Protein: %@ g / 100 g [Source: OpenFoodFacts]
sv: Kolhydrater: %@ g / 100 g Fett: %@ g / 100 g Protein: %@ g / 100 g [Källa: OpenFoodFacts]

# Fel: %@
source: Error: %@
sv: Fel: %@

# Ingen data levererades
source: No data delivered
sv: Ingen data levererades

source: Carbohydrates: %.1f g / 100 g Fat: %.1f g / 100 g Protein: %.1f g / 100 g [Source: Openfoodfacts]
sv: Kolhydrater: %.1f g / 100 g Fett: %.1f g / 100 g Protein: %.1f g / 100 g [Källa: Openfoodfacts]

# Kunde inte tolka svar från servern
source: Could not interpret the response from the server
sv: Kunde inte tolka svar från servern

# Fel vid tolkning JSON: %@
source: Error interpreting JSON: %@
sv: Fel vid tolkning JSON: %@

# Openfoodfacts produktmatchning OK
source: Openfoodfacts product match OK
sv: Openfoodfacts produktmatchning OK

# Kolhydrater: %.1f g / st
source: Carbohydrates: %.1f g/serving
sv: Kolhydrater: %.1f g / st

# Fett: %.1f g / st
source: Fat: %.1f g/serving
sv: Fett: %.1f g / st

# Protein: %.1f g / st
source: Protein: %.1f g/serving
sv: Protein: %.1f g / st

# Kolhydrater: %.1f g / 100 g
source: Carbohydrates: %.1f g/100 g
sv: Kolhydrater: %.1f g / 100 g

# Fett: %.1f g / 100 g
source: Fat: %.1f g/100 g
sv: Fett: %.1f g / 100 g

# Vikt per styck: %d g
source: Weight per serving: %d g
sv: Vikt per styck: %d g

# Vikt per styck: %.1f g
source: Weight per serving: %.1f g
sv: Vikt per styck: %.1f g

# ⚠️ Rensa allt
source: ⚠️ Clear all
sv: ⚠️ Rensa allt

# Vill du radera alla livsmedel från databasen?
source: Do you want to delete all food items from the database?
sv: Vill du radera alla livsmedel från databasen?

# Är du helt säker? Åtgärden går inte att ångra.
source: Are you sure? The action cannot be undone.
sv: Är du helt säker? Åtgärden går inte att ångra.

# Visa endast livsmedel som...
source: Only show food items that...
sv: Visa endast livsmedel som...

# finns i historiken
source: exist in history
sv: finns i historiken

# har en notering
source: includes a note
sv: har en notering

# saknar emoji
source: dont have an emoji
sv: saknar emoji

# är skolmat
source: is school food items Ⓢ
sv: är skolmat Ⓢ

# är angivna per styck
source: is saved as per portion ①
sv: är angivna per styck ①

# Lägg till livsmedel
source: Add food item
sv: Lägg till livsmedel

# Per Styck
source: Per Servinf
sv: Per Styck

# Ändra till per 100g ←
source: Change to per 100g ←
sv: Ändra till per 100g ←

# → Ändra till per st
source: → Change to per serving
sv: → Ändra till per st

# g/st
source: g/serv
sv: g/st

# Spara ändringar
source: Save changes
sv: Spara ändringar

# Inga ändringar
source: No changes
sv: Inga ändringar

# Ändra livsmedel
source: Edit food item
sv: Ändra livsmedel

# Lägg till nytt livsmedel
source: Add new food item
sv: Lägg till nytt livsmedel

# Skolmat:
source: School food:
sv: Skolmat:

# Skola:
source: School:
sv: Skola:

# Skola
source: School
sv: Skola

# Skolmat
source: School food
sv: Skolmat

# skolmat:
source: school food:
sv: skolmat:

# skola:
source: school:
sv: skola:

# skola
source: school
sv: skola

# skolmat
source: school food
sv: skolmat

# Ange vikt/styck (g)
source: Enter weight per serving (g)
sv: Ange vikt/styck (g)

# Omvandla näringsvärden
source: Convert nutritional values
sv: Omvandla näringsvärden

# Scanna streckkod
source: Scan Barcode
sv: Scanna streckkod

# Ogiltig URL
source: Invalid URL
sv: Ogiltig URL

# Kolhydrater: %.1f g / 100 g
source: Carbohydrates: %.1f g / 100 g
sv: Kolhydrater: %.1f g / 100 g

# Fett: %.1f g / 100 g
source: Fat: %.1f g / 100 g
sv: Fett: %.1f g / 100 g

# Källa: Openfoodfacts
source: Source: Openfoodfacts
sv: Källa: Openfoodfacts

# Befintlig data -> Ny data
source: Existing data -> New data
sv: Befintlig data -> Ny data

# Välj en favoritmåltid
source: Select a favorite meal
sv: Välj en favoritmåltid

# Sök favoritmåltid
source: Search favorite meals
sv: Sök favoritmåltid

# Radera favoritmåltid
source: Delete favorite meal
sv: Radera favoritmåltid

# Bekräfta att du vill radera: '"%@"'?
source: Confirm that you want to delete: '"%@"'?
sv: Bekräfta att du vill radera: '"%@"'?

# Ändra favoritmåltid
source: Edit favorite meal
sv: Ändra favoritmåltid

# Ändra mängd
source: Edit amount
sv: Ändra mängd

# Ange en ny mängd för %@:
source: Enter a new amount for %@:
sv: Ange en ny mängd för %@:

# Mängd: %@ st
source: Amount: %@ serving
sv: Mängd: %@ st

# Mängd: %@ g
source: Amount: %@ grams
sv: Mängd: %@ g

# Är du säker på att du vill radera alla favoriter?
source: Are you sure you want to delete all favorite meals?
sv: Är du säker på att du vill radera alla favoriter?
